<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/insight' }">行业洞察</el-breadcrumb-item>
        <el-breadcrumb-item>详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>我国IPv6发展现状与问题分析</h1>
        <p><time>发布时间： 2020-08-14</time>新闻出处： <a target="_blank" href="https://mp.weixin.qq.com/s/g81oqEQ0CpbF74Vmb-ejKw">信息通信技术与政策</a> </p>
      </header>
      <div>

        <h3>1 引言</h3>

        <p>2017年11月，中共中央办公厅、国务院办公厅联合印发了《推进互联网协议第六版（IPv6）规模部署行动计划》（以下简称《行动计划》），明确提出未来5~10年我国基于IPv6的下一代互联网发展的总体目标、路线图、时间表和重点任务，这是加快推进我国IPv6规模部署、促进互联网演进升级和健康创新发展的行动指南[1]。</p>

        <p>《行动计划》发布以来，政府部门、中央企业、基础电信企业、互联网企业、通信设备制造企业、科研机构等积极响应，纷纷制定具体的落地实施方案和工作计划，加快IPv6升级改造，使我国IPv6规模部署工作呈现加速发展态势。</p>

        <p>据国家IPv6发展平台统计，截止到2019年年底，我国IPv6活跃用户已经接近3亿[2]。根据中国互联网络信息中心（CNNIC）第45次《中国互联网络发展状况统计报告》显示，我国网民规模为9.04亿[3]，IPv6用户占比已接近30%。</p>

        <h3>2 以IPv6为基础的下一代互联网将为“新基建”夯实基础</h3>

        <p>2020年4月20日，国家发展改革委员会首次明确了新型基础设施的范围。新型基础设施是以新发展理念为引领，以技术创新为驱动，以信息网络为基础，面向高质量发展需要，提供数字转型、智能升级、融合创新等服务的基础设施体系[4]。新型基础设施主要包括3方面内容。</p>

        <p>一是信息基础设施，包括以5G、物联网、工业互联网、卫星互联网为代表的通信网络基础设施，以人工智能、云计算、区块链等为代表的新技术基础设施，以数据中心、智能计算中心为代表的算力基础设施等。</p>

        <p>二是融合基础设施，主要指深度应用互联网、大数据、人工智能等技术，支撑传统基础设施转型升级，进而形成的融合基础设施，如智能交通基础设施、智慧能源基础设施等。</p>

        <p>三是创新基础设施，主要指支撑科学研究、技术开发、产品研制的具有公益属性的基础设施，如重大科技基础设施、科教基础设施、产业技术创新基础设施等。</p>

        <p>相比传统基建，科技创新、数字化、信息网络这3个要素是所有关于新基建认知中的最大公约数，也是中国下一步经济发展的主要路径。</p>

        <p>从人与人之间的连接走向万物互联，所需的元器件整体数量更多，产生的数据更大，对时延等要求也更高。工业互联网、物联网的特性决定了其需要使用大量的IP地址。IPv6使得每一个单元都可以拥有独立的IP地址，使工业互联网和物联网得以落地。因此，IPv6成为支撑信息基础设施的基础。</p>

        <h3>3 网络基本实现IPv6“可用”</h3>

        <p>3.1 基础电信企业基本完成网络改造</p>
        <p>3.1.1 LTE网络和固定网络IPv6升级改造全面完成</p>
        <p>截至2020年1月，全国已有11.93 亿LTE用户、1.99 亿固定网络用户获得了IPv6地址。</p>

        <p>3.1.2 骨干直联点实现IPv6互联互通</p>
        <p>2019年，武汉、西安、沈阳、南京、重庆、杭州、贵阳·贵安、福州8个互联网骨干直联点全部完成了IPv6升级改造，支持互联网网间IPv6流量交换，加上2018年完成的北京、上海、广州、郑州、成都5个骨干网直联点，我国13个骨干网直联点全部完成了IPv6改造。</p>

        <p>3.1.3 基础电信企业IDC全面完成IPv6升级改造</p>
        <p>中国电信、中国移动、中国联通等基础电信企业已完成全部907个超大型、大型、中小型数据中心（IDC）的IPv6改造。</p>

        <p>3.1.4 内容分发网络资源对IPv6的支持能力持续提升</p>
        <p>2020年1月，网宿科技、阿里云、腾讯云、蓝汛、金山云、世纪互联、UCloud、白山云、七牛云、中国移动等主要CDN企业支持IPv6的节点数超过3195个。按照省级行政区划计算，IPv6全国覆盖能力达到99%以上，IPv6本地覆盖能力达到IPv4本地覆盖能力的85%以上，基本具备IPv6分发加速能力。</p>

        <p>3.2 网站及应用积极稳妥推进IPv6升级</p>
        <p>截止到2020年1月，全国91家省部级以上政府网站和96家央企网站中已有165家网站的首页可通过IPv6访问，支持率为88.2%。</p>

        <p>中国电信、中国移动、中国联通发挥运营商的自身优势，2019年除了完成门户网站、网上营业厅IPv6改造外，还分别完成了掌上营业厅、邮箱等自营业务排名前10的移动互联网应用（APP）的IPv6深度改造。根据最新监测数据，基础电信企业30款自营移动互联网应用平均IPv6流量占比超过71%。</p>

        <p>在用户量排名前100的互联网应用中，实现IPv6全国上线的有41个，上线地区超过半数的有12个、小于半数的有29个、未上线的18个。</p>

        <h3>4 从网络“可用”到网络“好用”</h3>

        <p>网络质量是网络“好用” 的基础。IPv6网络质量包括端到端网络质量和CDN质量两个方面。2020年年初进行的IPv6网络质量测试结果显示，相比2019年，2020年IPv6网络质量已经有了显著的改善。</p>

        <p>4.1 端到端网络质量</p>
        <p>4.1.1 测试方法</p>
        <p>测试采取“埋点” 的方法，测试端到端的网络指标，主要包括连接成功率和时延，连接成功率可以体现网络是否真正完成了改造，而时延则反映了整个网络的性能。</p>

        <p>4.1.2 测试结果</p>
        <p>在全国范围随机抽取10个省市，对某头部互联网应用进行测试，结果显示：大部分省市IPv6连接成功率要高于IPv4，且IPv6 时延低于IPv4，具体参见表 1。</p>

        <p>表 1 三家运营商不同地区IPv4与IPv6时延对比表</p>
        <img src="~/static/640.png" alt="">

        <p>从表1可以看出，10个省市中，除了山东电信、湖南联通外，IPv6的时延均低于IPv4的时延。可以说，这10个重点省市的IPv6 网络质量已经和IPv4网络质量趋同，达到网络“好用”的标准。</p>

        <p>4.2 CDN质量</p>
        <p>4.2.1 测试方法</p>
        <p>CDN测试采用第三方基调网络测试系统对各运营商的网络状况进行检测，并通过全国不同地理位置分布的监测节点来模拟真实的用户访问。由于监测节点为私募机器，该机器会因网络出口或网络带宽等问题影响测试性能。各区域添加的测试点数将结合客户需求及该区域节点的实际情况，由基调系统随机抽取。</p>

        <p>最终数据是综合中国大陆5个LASTMILE测试区域随机测出的结果，由几个核心综合指标构成。该指标体系能从不同技术纬度定量反映网站的服务质量，可以更有针对性地帮助提高网站性能。</p>

        <ul>
          <li>（1）性能指标：平均响应时间，该值越小，则响应时间越短。</li>
          <li>（2）可靠性指标：访问成功率，该值越高，则可靠性越强。</li>
          <li>（3）DNS时间：通过域名解析服务（DNS），将指定的域名解析成IP地址的消耗时间。</li>
          <li>（4）建立连接时间：IE浏览器和Web服务器建立TCP/IP连接的消耗时间。</li>
          <li>（5）首包时间：从IE浏览器发送HTTP请求结束，到收到Web服务器返回的第一个数据包的消耗时间。</li>
          <li>（6）内容下载时间：监测一个页面时，从页面角度来看，IE浏览器接收Web服务器返回的非第一个数据包的消耗时间。</li>
        </ul>

        <p>4.2.2 测试结果</p>
        <p>测试结果参见表2、表3。</p>

        <p>表2 测试性能数据表</p>
        <img src="~/static/640 (1).png" alt="">

        <p>表3 总体参数对比情况</p>
        <img src="~/static/640 (2).png" alt="">

        <p>4.2.3 测试数据</p>
        <p>测试地区分布参见表4；表5为测试结果。</p>

        <p>表4 测试地区分布</p>
        <img src="~/static/640 (3).png" alt="">

        <p>表5 测试结果</p>
        <img src="~/static/640 (4).png" alt="">

        <h3>5 存在的问题和挑战</h3>

        <p>IPv6已得到行业的广泛重视，但从 “可用”到“好用”，再从“好用”到“爱用”，仍然存在很多问题和挑战。</p>

        <p>5.1 活跃用户增长幅度与流量占比不匹配</p>
        <p>目前，我国已有2亿左右的IPv6活跃用户，但IPv6流量占比仍偏低，LTE网络IPv6流量仅为IPv4的5%左右，城域网流量占比不足3%。正常来说，在改造和放量期，活跃用户占比与流量占比偏差不应超过50%；全量后，该偏差不应超过30%。</p>

        <p>5.2 家庭无线路由器的支持率低限制了大流量的功能</p>
        <p>家庭无线路由器IPv6支持率偏低，已经成为整个IPv6规模发展的最大瓶颈。网络接入的“ 最后一公里”无法支持IPv6，无法带动视频、游戏这些大流量的提升。为了解决此问题，工业和信息化部在2020年的工作计划中明确要求，家庭无线路由器厂商不仅要对存量终端进行升级，还要对新上市的终端默认支持IPv6功能。</p>

        <p>5.3 安全挑战</p>
        <p>相对于IPv4网络，IPv6在组网架构、服务提供方式上有较大的变化，这些变化也对IPv6的安全提出了更大的挑战。例如，在云产品中，原来用于IPv4的许多安全解决方案可能不再适用于IPv6，此外也涉及到网络、业务和用户数据、用户隐私管理和控制等方面的安全问题。</p>

        <p>5.4 产业生态尚需培育</p>
        <p>多年来，由于IPv4地址短缺，我国互联网的发展一直深陷“网络地址转换（NAT）” 技术泥潭中。很多企业出于自身成本利益的考虑，对切换至IPv6持观望态度，相关厂商在IPv6领域中独自摸索。产业生态尚未成熟，业界对IPv6未来发展的理解不尽相同。IPv6的最终目的是促进各行业的数字化转型，全面支持“新基建”，所以其不仅需要全面构建面向垂直行业个性需求的多元化平台，还需要进行广泛的跨界合作。</p>

        <h3>6 发展建议</h3>

        <p>6.1 加强家庭无线路由器的IPv6支持</p>
        <p>家庭无线路由器的IPv6支持两个方面：一是路由器要和上游运营商提供的智能家庭网关匹配，为用户提供IPv6接入能力；另一方面，可以通过自动推送固件的方式升级，避免繁琐的设置。</p>

        <p>目前，对于家庭无线路由器如何支持IPv6并没有统一的技术规范，企业都是各自为战。建议相关部门尽快出台技术规范，以标准化为手段引导和促进产业链的高效合作。标准化是一个系统工程，需要权威机构进行统一规划，为标准的制定提供指导思路；对已经应用的关键技术，及时进行标准化，确保互操作性和连续性。</p>

        <p>6.2 完善IPv6相关安全机制</p>
        <p>网络与信息安全是推进IPv6健康发展的前提，有效的安全机制可以避免IPv6引入对运营商基本网络和互联网应用服务的不良影响，从技术和管理上切实保障安全，扫除互联网应用的顾虑。“ 新基建” 的提出，对安全和可靠性提出了更高的要求，需要迅速完善相关的安全产品，保障其安全性。</p>

        <p>6.3 构建开放共赢的产业生态</p>
        <p>IPv6不仅是网络技术的创新，同时也是商业模式的创新。5G、物联网、工业互联网除了技术与场景、网络与应用的融合，还有生态的合作。构建产业生态需要更开放的合作研究和更广泛的行业实践，只有在产业链的共同努力推进下，才会促进IPv6的更快发展。为了推动IPv6的规模部署与发展，应该不断完善融合政策体系，为运营商和行业的合作渠道或载体提供便利，构建共赢的产业生态。</p>

        <h3>7 结束语</h3>

        <p>5G、云计算的到来，进一步驱动高带宽和低时延业务的发展，物联网、工业互联网带动了海量IP地址需求，这些新业务使得规模部署IPv6成为必然，也将为IPv6产业创造重要机遇。IPv6的根本目的是服务于整个网络，加速各个行业从IPv4向IPv6转型，所以需要加强顶层设计，营造有利的政策环境以促进产业链上中下游各方的高效协作。同时，需要通过制定和完善技术与产业标准，推广成功案例经验，引导和加快IPv6在行业的落地应用和服务创新。</p>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
    p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
.point {
  display: inline-block;
  width: 10px;
  height: 10px;
  background: #333;
  border-radius: 50%;
  margin-right: 5px;
}
</style>