<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/insight' }">行业洞察</el-breadcrumb-item>
        <el-breadcrumb-item>详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>中国IPv6发展步入黄金时代</h1>
        <p><time>发布时间： 2020-09-30</time>新闻出处： <a target="_blank" href="https://mp.weixin.qq.com/s/Zkq0gaUGpLdU6OVINrWeoQ">中国教育网络</a> </p>
      </header>
      <div>

        <p>7月30日下午，广州南沙。</p>

        <p>满头银发的邬贺铨院士一行匆匆走进“2020年下一代互联网峰会”的会场，在落座前他停顿了一下，专门跟CERNET网络中心副主任李星教授握了下手。这次有意无意的握手未必会被摄影器材抓拍下来，却无形中表达了某种历史隐喻：两人多年来为IPv6鼓与呼，做而行，共同经历了IPv6起步时后来居上的“白银时代”，以及之后十余年无可奈何的“青铜时代”，如今IPv6在中国终于步入令人振奋的“黄金时代”，他们两位心中应该也是感慨万千吧。</p>

        <p>念念不忘，必有回响。这其中浓缩的，却是中国互联网先驱、科研人员的远见与坚持，以及一个时代的嗟叹和反思。</p>

        <p>实际上，在一年前举行的“2019中国IPv6发展论坛”上，李星教授已经发出了互联网界的“李约瑟之问”：作为世界上最早开展IPv6研究和实践的国家之一，如果 20多年前我国就推出IPv6 部署行动计划，如今全球 IPv6将会是什么格局？</p>

        <p>每个熟悉IPv6历史的人自然明白他的言下之意：上世纪90年代的中国是全球最早开展IPv6研究和实践的国家之一，为什么到现在为止中国依然不是IPv6大国，甚至一度在部署方面远远落后于其他国家？</p>

        <p>这个问题放到当前中美两国在经济、科技等领域全面竞争的大背景下重新审视尤有深意，无论能否找到答案，我们都需要重温和复盘两国在下一代互联网 IPv6 方面竞争和反转的历史，希冀从中找出某些规律，对今后我国科研趋势把握以及其他大型的科研项目有所借鉴。</p>

        <h3>01 白银时代：一鸣惊人</h3>

        <p>我们先将时钟拨回到1973年，美国的Vint Cerf和Robert Khan等众多互联网先驱们经过不懈的努力，终于向世界奉上了奠定互联网大规模推广和应用基础的TCP/IP协议。</p>

        <p>当IPv4协议（互联网协议第四版）在1981年问世的时候，工程师们总共设计了43亿个IP地址，这一数量对于当时的用户来说完全是个天文数字，然而时代的确是限制了科学家们的想象力：截至今年3月，仅中国的互联网用户就突破9亿，按照一个中国人有三个联网终端（笔记本、手机、PAD）计算，就会占据全球一半还多的IPv4地址。但实际上中国仅有3.38亿IPv4地址，人均还不到0.45个。目前，全球IPv4地址均已耗尽，这个问题不解决，地址危机将直接影响全球互联网的发展进程。</p>

        <p>IPv6因此应运而生，作为互联网协议的第六版，它将IPv4的32位地址格式扩展至128位，相应的IPv6有拥有2的128次方个地址，相当于地球上每一平方米可以获得10的26次方个地址。这意味着，如果需要，地球上每一粒沙子都可以拥有一个IP地址。</p>

        <p>对于1994年才全功能接入中国的互联网，我们的接受程度是一个逐步加快的过程，然而对于被誉为下一代互联网的IPv6，相比美国一开始的“漫不经心”，中国某些学术机构和个人却表现出了惊人的预见性和超前意识，这也为中国在互联网基础设施和核心技术突破的后来居上提供了某种可能和契机。</p>

        <p>在IPv6诞生的相当长的一段时间里，作为互联网以及TCP/IP协议发源地的美国除了2003年左右比较重视并在有限范围内推进之外，IPv6长期被忽视。这可以归结为相对需求的经济命题，当时，全世界大部分的网络资源和核心技术都掌握在美国人的手里，70%以上的IP地址为美国所有，互联网原有的架构并不影响他们的发展战略和运营商盈利空间，因此他们很少感受来自地址容量紧张的压力。</p>

        <p>当包括美国在内的全球大部分国家对IPv6还没有充分重视的时候，中国已经走在前面。1997年，清华大学李星教授领衔的研究组就建立了中国第一个IPv6试验网，并于1998 年代表 CERNET接入到全球 IPv6 试验网 6Bone，这是中国下一代互联网发展进程中的标志性事件，意味着我国正式踏上IPv6研究和发展之路，这早于绝大多数国家和地区，欧盟的IPv6研究始于2000年，美国的教育网接触IPv6则是在2002年以后了。</p>

        <p>之后在邬贺铨院士等专家的推动下，国家开始重视IPv6网络的建设。2003 年，在 57 位院士建议下，经国务院批复，8个部委联合启动中国下一代互联网示范工程CNGI。由于IPv6与IPv4不兼容，包括国际IETF推广以及国内外大多数运营商都采用的是双栈技术，但承担CNGI-CERNET2建设的中国教育和科研计算机网当时已经认定IPv6必然是未来互联网建设的趋势，在吴建平院士带领的CERNET专家委员会的坚持下，决心要建设纯IPv6的主干网络，一步到位，这才有了现在全球规模最大的采用纯IPv6技术的下一代互联网主干网CERNET2，并创新性地提出了真实源地址验证技术及IPv6翻译过渡技术IVI。2006年，互联网之父Vint Cerf参观CERNET2 之后热情称赞，认为在下一代互联网的建设上，中国走在了美国的前面。</p>

        <p>根据国际互联网组织的统计，当时全世界IPv6互联网普及率排名中国第一，美国第二。从用户数量来看，中国是500万，基本都是CERNET2的用户，美国仅为200万。如果按照这个步伐和速率走下去，更大程度的后来居上和 IPv6 超前普及完全可以期待。</p>

        <p>就在此时，历史开了一个很大的玩笑，我国整体上的IPv6发展热潮突然“熄火”，这段在互联网核心技术和IPv6部署暂时领先的“白银时代”戛然而止。</p>

        <h3>02 青铜时代：剧情反转</h3>

        <p>正当中国IPv6发展停滞不前的时候，世界上其他国家却慢慢反应过来了。</p>

        <p>原因也很简单，随着互联网的快速发展和用户的高速增长，越来越多的国家认识到，互联网是关系国民经济和社会发展的重要基础设施，其治理更是深刻地影响着全球经济格局、利益格局和安全格局。</p>

        <p>基于互联网协议第四版(IPv4)的全球互联网正面临着网络地址消耗殆尽、服务质量难以保证等制约性问题，加快构建高速率、广普及、全覆盖、智能化的下一代互联网(IPv6)成为当务之急。</p>

        <p>美国很快也从一开始的漫不经心，变得“认真”起来。谷歌等巨头们开始部署IPv6，学术网Internet2开通IPv6，设备商提供IPv6解决方案，运营商提供IPv6服务，操作系统全面支持IPv6。2012年发布《政府IPv6应用指南/规划路线图》全面推动IPv6的商用部署。随着网络宽带化改造和LTE网络的建设，美国IPv6商用化进程明显加速，IPv6地址申请量位居全球第一，IPv6 网络覆盖规模比例超过40%，主流ICP 内容服务商全面支持IPv6。</p>

        <p>其他国家和地区也没有闲着，欧盟发布文件要求运营商和大型网络部署IPv6，用政府采购促进和带动IPv6发展和布局，为推动欧洲IPv6网络研究，欧盟投入约一亿欧元资金，在这个过程中，比利时因为“地利”搭上了欧盟的顺风车，成为IPv6部署的最大受益者，由于其首都布鲁塞尔是欧盟总部所在地，它顺势发展为全世界IPv6部署率最高的国家之一。</p>

        <p>有趣的一幕发生在我们的邻国印度身上。2010年，当时印度的互联网用户仅2000万。IPv6论坛主席Latif Ladid还在一次国际会议上表示，印度方面并不重视IPv6网络技术，对IPv4向IPv6网络过渡不积极，与中国相比不在同一个级别上。然而包括他在内的大多数人绝对没有想到，就在短短9年之后，印度的IPv6用户数突破3亿，是全球IPv6用户数的一半还多。</p>

        <p>反观中国IPv6的发展，则一度陷入了雷声大、雨点小的尴尬境地。尽管我国是全世界最早开展IPv6研发和应用的国家之一，却“起了个大早，赶了个晚集”。原因比较多：一是用户长期在IPv4环境下获取网络服务，习惯于用私有地址通过NAT上网，还没有形成对固定IP地址的使用习惯和强烈诉求，因而未能给网络运营商造成向IPv6演进的足够压力；二是中国互联网企业整体上缺乏国际竞争力，缺乏像谷歌、亚马逊那样拥有着极强社会责任感的大企业向IPv6迁移；三是网络运营商和信息提供商之间没有形成合力；四是政府决策部门和产业领域受到一些五花八门技术的干扰，等等。</p>

        <p>这段大逆转可以称之为中国IPv6发展史上的“青铜时代”。当然，即便是在这个“万马齐喑”的时期，中国IPv6的研究者和实践者从来没有放弃过呼吁和努力，像邬贺铨院士、吴建平院士是其中的重要代表，他们依然以自己的满腔热情投入到推动中国IPv6发展的事业当中。</p>

        <p>他们的心血没有白费，2017年，曙光再现。</p>

        <h3>03 黄金时代：突飞猛进</h3>

        <p>2016年11月，全球互联网最具权威的技术标准化组织——国际互联网工程任务组（IETF）的体系结构委员会（IAB）发布了一个声明，希望未来的互联网协议标准全部基于IPv6来制定，新设备和新的扩展协议不再兼容IPv4。</p>

        <p>这个公告发出了非常明确的信号，表明IETF正式确认未来互联网将建立在IPv6的基础上。也因此，IPv6成为互联网技术无可争议的发展趋势和方向，而对于以“万物互联”为目标的物联网，IPv6同样是下一代人类智能生活的枢纽工程。同时这也意味着，中国IPv6的发展已经到了时不我待的紧急时刻，相比很多国家，我们已经落后太多了。</p>

        <p>一年后，中共中央办公厅、国务院办公厅印发了《推进互联网协议第六版（IPv6） 规模部署行动计划》（以下简称《行动计划》），明确指出我国基于 IPv6的下一代互联网发展的总体目标、路线图、时间表和重点任务，提出用5到10年的时间，形成下一代互联网自主技术体系和产业生态，建成全球最大规模的IPv6商业应用网络，是加快推进我国 IPv6 规模部署、促进互联网演进升级和健康创新发展的行动指南。</p>

        <p>IPv6规模部署的集结号已经吹响，平时离散的所有建设力量集结成军，齐头并进。自《行动计划》发布以来，政府部门、中央企业、基础电信企业、互联网企业、通信设备制造企业、科研机构等迅速行动起来，纷纷制定具体的落地实施方案和工作计划，加快 IPv6 升级改造，效果有目共睹。</p>

        <p>目前，中国已分配IPv6 地址的用户数快速增长，IPv6 活跃用户数显著增加，截至2020年7月，我国IPv6规模部署取得重大进展，IPv6活跃用户已达3.62亿，约占中国网民的40.01%，IPv6地址资源位居全球第二。</p>

        <p>据APNIC统计数据显示，截至2019年7月1日，我国IPv6用户数增长迅速，全球排名从2019年初的第66位跃至第6位，释放出巨大的可持续发展动能。而放眼世界，推进IPv6规模部署专家委员会主任、中国工程院院士邬贺铨的预测，全球IPv6正在步入发展快车道，未来5年里，全球IPv6用户的占比将达到70%以上，这其中必然有中国的重要贡献。</p>

        <p>在今年广州南沙举行的“2020全球IPv6下一代互联网峰会”上，由中国工程院院士邬贺铨、互联网之父 Vinton Cerf、全球IPv6论坛主席Latif Ladid、下一代互联网国家工程中心主任刘东等国内外专家还在中国正式发布了全球首份“推进IPv6规模部署向纯IPv6发展联合倡议”，倡议将2020年作为全球大规模加速部署纯IPv6的元年，呼吁所有人参与到纯IPv6最佳实践的贡献中来，共同推进纯IPv6规模部署与IPv6融合技术，为当前数字经济和未来的繁荣做出更加重要的贡献。</p>

        <p>这无疑体现了我国在IPv6部署方面的远见和决心。</p>

        <p>更让人惊喜的是在技术认知层面，大部分人都已经意识到，IPv6是下一代互联网创新的起点。在互联网发展的历程上，数据通信产业经历了Native IP、MPLS两代协议。下一步，应该依托我国IPv6规模部署进展成果，整合IPv6相关产业链力量，加强基于IPv6下一代互联网技术体系创新，从网络路由协议、管理自动化、智能化及安全等方向积极开展IPv6创新研究、试验验证、应用示范，不断完善IPv6技术标准体系，将有力提升我国在下一代互联网领域的国际竞争力。</p>

        <p>政府坚定部署，业界坚定执行，学界坚定支撑，中国IPv6进入黄金时代，名副其实。</p>

        <p>当然，我们还要看到困难，不断寻找最优解，尤其是要解决IPv6技术创新方面的阻碍、瓶颈以及部署动力问题，这样才能够保障IPv6规模部署乘风波浪，尽快成为我国物联网、5G、云计算等新兴技术的基础和底层逻辑</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
    p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
}
</style>