<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/news' }">新闻列表</el-breadcrumb-item>
        <el-breadcrumb-item>新闻详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>边缘化带来的IP空间复杂性</h1>
        <p><time>发布时间： 2020-06-5</time>新闻出处： <a href="/">连星科技</a> </p>
      </header>
      <div>

        <p>边缘计算是在靠近物或数据源头的网络边缘侧，融合网络、计算、存储、应用核心能力的分布式开放平台，就近提供边缘智能服务。满足行业数字化在敏捷联接、实时业务、数据优化、应用智能、安全与隐私保护等方面的关键需求。它可以作为联接物理和数字世界的桥梁，使能智能资产、智能网关、智能系统和智能服务。</p>

        <p>
          通过使用数据中心，无论是内部还是云中，我们已经解决了许多 IT 问题。将资源集中在数据中心是明智之举。通过虚拟化，它可实现优化、提高基础架构恢复能力并降低所有硬件的能耗。然而，向云的移动凸显了法规、新用法和安全性所隐含的新挑战。这可能促使企业将某些数据和工作负载移回更靠近使用情况和用户的数据和工作负载。

        </p>
        <p>
          边缘云将随着5G、云计算和工业互联网等“新基建”在2020年实现真正加速。将部分存储和计算能力从中央云转移到边缘需要注意IT系统的构建方式。CDN提供商将增加更多具有无服务器功能（Serverless functions）的计算功能，而传统的大型云提供商将为企业增加更多的小型区域数据中心和内部解决方案。随着SASE（安全访问服务边缘）等将WAN访问和网络安全即服务结合在一起，对安全边缘访问点的要求也可能会更加成熟。

        </p>

        <p>
          但是，这种新的体系结构方法带来了基础架构和网络挑战。将部分存储和计算能力从中央云移动到边缘需要关注 IT 系统的构建方式。显然，虚拟化和容器等技术有助于将应用程序块从一个位置移动到另一个位置，具有足够的抽象性来限制影响。网络必须适应，多播用于服务发现，直接在网络中集成数据库，SDN、NFV 和用于安全主题的零信任方法。日志和分析系统是强制性的，以便知道哪些作业已处理，不仅出于计费目的，还用于可追溯性。

        </p>
        <h3>
          将内容位置移动到边缘
        </h3>
        <p>
          从技术角度来看，将计算能力和存储带到边缘并不是一个问题。它要求使用数据中心中使用的现代体系结构模板。必要时，它还需要接受服务连续性约束和数据法规。通过边缘服务，我们可以想到的第一个明显功能是内容交付网络。CDN
        </p>
        <p>带来了缓存的存储以及智能，以引导用户访问其内容。它还将静态内容存储在本地缓存中时，还可以优化性能。虽然 CDN 为内容传递带来了很多价值，但它仅限于缓存的对象。但是，将这些对象的位置移动到云的边缘可减少用户的响应延迟，并限制全局网络上的带宽消耗。这明显增强了用户体验。
        </p>

        <h3>
          物联网和云的边缘计算
        </h3>

        <p>
          越来越多的用例需要计算能力，而不仅仅是内容缓存。例如，所有连接的对象（IoT） 可能会生成大量数据进行分析，但仅需要一小部分此数据。趋势和警报模型（考虑数字仪表）可以在中间级别运行，从而实现多个级别的优化。在这种情况下，使用边缘计算能力是有价值的：仅用于触发警报的数据可能会快速丢弃，并且不会消耗带宽，因为只有有价值的事件才会传送回云。用户将只能访问有价值的事件，这些事件比原始数据更有趣。此外，并非所有组织都有能力存储为将来可能使用而生成的大量数据。

        </p>
        <p>
          特定区域的监管迫使公司在同一区域（例如我国的《网络安全法》）内存储和处理数据。云方法（尤其是公共云）并不总是适合满足位置要求。这可能需要由云提供商提供但仅在其他区域提供的特定服务。这就要求在服务和区域之间来回传输数据，这非常复杂，设置起来而且几乎不可能及时审核。此外，云提供商并不总是在服务之间传输数据的位置。
        </p>

        <h3>
          为什么我们需要边缘计算？
        </h3>

        <p>
          边缘计算的用法非常多样化。越来越多的终端需要计算，但可能会因本地算力不足而受到影响。即使并非所有的场景都是面向业务的，但是，大多数都会为企业或社区带来真正的利益。我们需要认真考虑如果更好的使用这些新设备，特别是5G的加持，可以把AI芯片以及开发工具、操作系统和物联网模块集成在一起，形成智联网的终端设备。
        </p>
        <h3>
          数据管理与隐私
        </h3>

        <p>
          传感器和捕获器等终端设备正在收集越来越多的数据，在某些情况下，由于技术限制，这些数据无法发送到云（特别是中心云）。因此，使用局部计算进行分析是非常有益和实际的。可以想象，如果要分析飞机在地面上收集的所有数据（发动机、结构、天气条件），必须将数据传送到云中心进行计算，这将需要非常大的带宽，以及较低的传输延迟，但这并不总是与云兼容。另一个很好的例子是医疗和健康数据，这些数据可能需要在控制水平高的特定认证环境中存储，由于这种严格的限制，保护个人健康数据可能不适合公共云提供商，也不适合大多数托管运营商。
        </p>

        <h3>
          产业互联网
        </h3>
        <p>
          从企业视角来看产业互联网的组成，底层有数控机床，有联网的仪器仪表，有现场总线仪表，还有分布控制系统、现场控制系统、可编程逻辑控制器以及各种各样的传感器，这对应企业的物联网，它使用的传感网的协议。产业互联网上还要有一个企业内网，对应于工厂内部网络，它收集送来的各种各样的数据，在企业内网里有服务器，有监控数据采集系统，当然还有边缘计算。企业内网的通信协议可以使用工业以太网的协议和TSN（时延敏感网络）协议。工厂收集了这些数据要送到企业，企业里具有工业互联网平台，这个平台上面包含了各种各样的数据库、服务器，当然更需要有云计算。
        </p>

        <p>
          在产业互联网里面很重要的是云的应用，很多工业上的传感器、工业机器人、工业VR/AR对时间比较敏感，因此需要把云的能力一部分分出来，下沉到靠近数据源端，这叫边缘云。边缘云负责处理那些对时间敏感的数据，它过滤了一些数据然后再送到中心云，中心云收集各个边缘云上报的数据，通过训练优化出数据模型，再下发给边缘云执行。通过两级云减轻了对中心云的压力，也减轻了对带宽的消耗，同时提供快速的响应，增加了可靠性，并且两级云和单个云相比成本还可以节省。需要指出，对大企业会自建中心云和边缘云，对于中小企业，中心云将使用第三方的公有云，但边缘云还是自己建，边缘云里面处理分析软件跟企业本身所需要处理的业务内容是相关的。

        </p>
        <h3>
          智能物联网
        </h3>
        <p>
          当然，物联网 （IoT） 是一个很广泛的主题，涵盖从灯泡到自动驾驶车辆的各种设备。物联网是感知数据，感知数据需要送到后台进行大数据分析和人工智能的决策。如今，5G的出现催生了 “智能物联网”。在5G之前的网络带宽不够，时延比较大，送过去再回来决策已经错过了时效性。在5G时代，它不仅是高带宽低时延，还是大连接，端到端的时延不超过10秒，丢包率不超过1%，5G的到来使得物联网和云计算无缝融合，数据直达分析决策，决策第一时间就回到物联网终端来执行，人工智能+物联网成为智联网（AIOT）。一些要求比较高的物联网终端，例如超高清的摄像头、无人机和机器人，把人工智能和物联网相融合；更进一步还可以在 AIOT的模块里面嵌入区块链，这样可以保证物联网接入设备验证、数据加密和授权安全，解决数据确权和数据资产化的问题。

        </p>

        <h3>
          智能事物和知识产权
        </h3>
        <p>
          工业和公用事业部门没有利用物联网从现场收集的信息，但是有监测和警报的需求，主要用途包括增强服务、监视活动和向客户计费。工业传感器无处不在，它们管理的数据或警报在我们的日常生活中非常重要。设备已经转移到特殊的无线网络（如NB-IoT、LoRa等），其中一些使用IP。 我们经常在智能计量和智能城市中使用这些智能的设备。
        </p>
        <p>
          另一个重要事项是资产跟踪和盘存。比如在大型仓库或集装箱的港口中，集装箱的资产不断移动，需要由搬运车辆或准备机器人做出决策。与激光雷达和跟踪器映射系统链接的数据量需要快速处理，并且数据的动态程度不必要长期存储。同时，在这些工业场景中，并非所有设备都是智能设备，也不是使用IP进行连接。这需要在IP世界和"物理世界"（例如RFID标签）之间提供一些网关。这种转换要求在靠近设备的位置进行，使边缘计算成为理想的解决方案。

        </p>

        <h3>
          农场监控
        </h3>

        <p>
          农场监视区域使用可在网络边缘提供自动化的传感器。传感器用途广泛，包括带智能衣领的动物（主要用于本地化和健康监测）、通过洒水器和自动驾驶车辆进行作物浇水；真实的PM2.5空气指数，农场温度、湿度、阳光指数和气压等。所有这些设备都需要与本地计算资源快速交互，因为云网络可能很远。大多数监控设备未被高速网络运营商很好地覆盖，因此对云资源的访问对于某些用途来说可能不够实际。农场智能分析和决策所需的数据量可能非常大而且不稳定，这意味着将这些数据推送到任何云工作负载中心可能不是最佳的实践。利用边缘计算。通过分析来自众多监控服务的本地传感器和从提供程序收集的全局传感器的数据，可以做出在本地有效的快速决策。

        </p>
        <h3>
          供应商和解决方案正在走向边缘
        </h3>
        <p>
          边缘计算需求列表很长，各种边缘计算业务形态面向的客户场景不同，体现的客户价值也不同，所以每种边缘计算业务形态对于与云计算协同的内涵、关键技术等都有较大的区别，这些形态需要 IT技术快速适应。

        </p>
        <p>
          目前边缘计算的价值场景包括智慧园区、安卓云与云游戏、 内容分发网络 CDN、视频监控、工业物联网、Cloud VR 等， 其中智慧园区、视频监控、工业物联网属于 2B 业务，安卓云与云游戏、内容分发网络 CDN、Cloud VR 属于 2C 业务。边缘计算价值场景使用的关键能力主要包括：海量网络联接与 管理、实时数据采集与处理、本地业务自治、 边云协同、图 像识别与视频分析、AR/VR、游戏渲染与呈现，以及数据安全与隐私保护等。

        </p>

        <p>
          从细分价值市场的维度，边缘计算主要分为三类：电信运营商边缘计算、企业与物联网边缘计算、工业边缘计算。围绕上述三类边缘计算，业界主要的ICT、OT、OTT、 电信运营商等玩家纷纷基于自身的优势构建相关能力，布局边缘计算，形成了当前主要的六种边缘计算的业务形态：物 联网边缘计算、工业边缘计算、智慧家庭边缘计算、广域接 入网络边缘计算、边缘云以及多接入边缘计算(MEC)。在实际部署的商业用例中，上述的六种业务形态可以 独立存在，也可以多种业务形态互补并存。

        </p>
        <h3>
          CLXOne® 最佳实践
        </h3>
        <p>
          边缘计算扩展云的一个严峻挑战涉及 IP 空间的管理。更确切地说，需要解决IP清单和路由、命名约定、资源清单、设备管理、DNS和应用程序流量管理。如今，所有这些主题都被视为企业的核心基础服务，但IT管理者和工程师需要重新考虑，以便有效地将存储和工作负载推送到处于边缘的完全虚拟环境中。与IPAM 解决方案高度耦合，与该生态系统和 DNS 等引擎相结合，将简化边缘扩展，并保持 IT 系统操作的连续性。

        </p>
        <p>
          处理复杂性需要充分的了解，严谨，准确的动态库存以及毫无疑问的智能自动化。连星科技推动核心网络服务从简单的数据库到分布式、高可用性解决方案的演进，再到创新云管理 DDI 。连星 CLXOne® DDI 构建了国内领先的可扩展企业级云平台，该平台通过云管理的服务和应用程序形式提供DDI和安全功能等基础服务。CLXOne® DDI 可以满足组织当前和未来的所有 DDI 需求。如，集中控制 DDI 服务的同时，实现与云和虚拟化平台无缝集成；通过云管理 DDI 和本地化服务部署来从根本上改善远程和分支机构的网络连接等。

        </p>
        <p>
          CLXOne® DDI 解决方案在确保整个分布式高可用性 DNS，DHCP 和 IPAM 服务的同时，使组织更轻松地实现跨各种基础架构（包括本地，云和混合部署、IoT等）的更高水平的服务正常运行时间，安全性以及运营效率。CLXOne® DDI 具有灵活的虚拟或物理外形，不仅满足总部集中管理的需要，还可用于远程位置和分支机构。凭借基于微服务的架构，它将控制和管理功能移至云中，仅需在本地使用轻型虚拟设备，提供高可用的本地化能力。

        </p>
     
      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
    p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
</style>