<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/news' }">新闻列表</el-breadcrumb-item>
        <el-breadcrumb-item>新闻详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>IPv6能为物联网带来什么？</h1>
        <p><time>发布时间： 2020-03-16</time>新闻出处： <a href="https://iot.ofweek.com/2020-03/ART-132207-8500-30431781.html">OFweek物联网</a> </p>
      </header>

      <div>
        <p> 随着互联网时代的到来，人们的工作、生活等习惯发生了翻天覆地的变化，而人们享受着互联网带来的便利性。</p>

        <p>然而，在2014年8月12日下午4点钟开始，全世界的网络突然都变慢了一点点，对于普通人而言，网络速度慢了一点点似乎并不受影响，但对于金融、国防等重点行业来说，哪怕是慢了1毫秒，都会导致各类问题出现。</p>

        <p> 而引发网络变慢的原因，只是路由规则太多。</p>

        <h3> IPv4最后的“挣扎”
        </h3>
        <p>IPv4作为一种无连接的协议，全称是“网际协议版本4”，又称互联网通信协议第四版，是网际协议开发过程中的第四个修订版本，也是此协议第一个被广泛部署的版本。IPv4是互联网的核心，也是使用最广泛的网际协议版本。</p>

        <p> 早在二十多年前，“IPv4即将枯竭”的信息就不绝于耳，而这并非空穴来风——互联网建立之初，并非给所有人应用，而是美国军方。
        </p>
        <p>如果单一给美国军方使用互联网，IPv4地址空间中有4，294，967，296（2的32次方）个地址，足够美军使用。但一旦应用在普通民众中，IPv4的地址数量并不足以支撑起整个世界。</p>

        <p>尤其是进入21世纪后，随着计算机和智能手机的迅速普及，互联网开始爆发性发展，越来越多的上网设备出现，越来越多的人开始连接互联网。这就意味着，需要越来越多的IP地址。</p>

        <p>虽然IPv4有近43亿个地址，但其并非每个用户都能使用一个地址，特别是对家庭电子设备多的用户而言，IPv4最多只能做到一个路由器采用一个地址。</p>

        <p>如何解决IPv4地址不足？科研人员也绞尽脑汁，目前最常用的解决方案为以下两个：</p>

        <ul>
          <li>
            1、提高IPv4地址的空间利用效率。如子网技术和超网技术，这些技术是解决由于IPv4地址类别之间空间差异过大，导致地址空间利用率太低而出现的；

          </li>
          <li> 2、利用私网（NAT）技术对IP地址进行重用，从而等效于实现了IP地址空间的扩展。
          </li>
        </ul>

        <p>但不可避免的是，即使采用以上两种方法，都不可避免遇到IPv4地址总空间的根本限制。</p>

        <p>如何让地址数量增加？最为根本的解决方案是使用IPv6。</p>

        <h3>IPv6，能否支撑起物联网世界？</h3>

        <p>随着国内物联网的普及，万物互联的时代已经来临。</p>

        <p>然而，每一个设备都会采用到单一的IP地址，就IPv4的容积而言，IPv4并不足以支撑起上百亿设备的市场。</p>

        <p>IPv6被提上了日程。</p>

        <p> IPv6是英文“Internet Protocol Version 6”（互联网协议第6版）的缩写，是互联网工程任务组（IETF）设计的用于替代IPv4的下一代IP协议，其地址数量号称可以为全世界的每一粒沙子编上一个地址。
        </p>
        <p>然而早在1990年，IETF（互联网工程任务小组，成立于1985年底，是全球互联网最具权威的技术标准化组织）就开始规划IPv4的下一代协议。他们还建立了临时的ad－hoc下一代IP（IPng）领域来专门解决下一代IP的问题。</p>

        <p>为了更好的推动这一领域，该项目组拉了15名来自不同工作背景的工程师，并在1994年7月25日采纳了IPng模型，并形成数个IPng工作组，从而建立下一代通信协议。</p>

        <p>在1996年，用于定义IPv6的RFC发表出来，最初的版本为RFC1883。</p>

        <p>但随后发现略为尴尬的一幕——由于IPv4和IPv6地址格式等不相同，两者无法直接通信。</p>

        <p>但对于IETF而言，这并没有成为拦路虎——IETF通过设定中间网关或者使用其他过渡机制，实现了IPv4和IPv6的直接通信。</p>

        <p>2003年1月22日，IETF发布了IPv6测试性网络，即6bone网络。它是IETF用于测试IPv6网络而进行的一项IPng工程项目，该工程目的是测试如何将IPv4网络向IPv6网络迁移。</p>

        <p>作为IPv6问题测试的平台，6bone网络包括协议的实现、IPv4向IPv6迁移等功能。</p>

        <p>随着十多年的发展，IPv6已经被很多通信网络和终端设备厂商支持，取得了长足的进步。</p>

        <p> 以我们用的最多的windows电脑操作系统来说，从Windows 2000开始，就已经支持IPv6了。到Windows XP时，进入了产品完备阶段。而Windows Vista及以后的版本，如Win7、Win8、Win10等，都已经完全支持IPv6。
        </p>
        <p>2012年6月6日，国际互联网协会专门举行了“世界IPv6启动纪念日”。这一天，多家知名网站（如Google、Facebook和Yahoo等）正式开始永久性支持IPv6访问。</p>

        <p> 而据相关报道，IPv6支持的数量，相比IPv4得到大幅度提升，其可分配 34028236692093846346……个地址，也就是2的128次方个地址，而这个数量级，即使是给地球上每一颗沙子都分配一个IP，也足够使用。
        </p>
        <p>那么IPv6有什么优点？</p>

        <ul>

          <li>
            1、IPv6使用更小的路由表；
          </li>
          <li>
            2、IPv6增加了增强的组播支持以及对流的控制，对多媒体应用很有利，对服务质量（QoS）控制也很有利；
          </li>
          <li>
            3、IPv6加入了对自动配置的支持；
          </li>
          <li>
            4、IPv6具有更高的安全性；
          </li>
          <li>
            5、IPv6具有更好的扩容能力；
          </li>
          <li>
            6、IPv6具有更好的头部格式；
          </li>

        </ul>

        <p>……</p>

        <p>可以说，IPv6的出现，将直接解决当前物联网承载数量问题。</p>

        <p>但从2012年IPv6的推出，已经过去8年，为何IPv6没有实现全面普及？</p>

        <h3> IPv6为什么没有取代IPv4？</h3>

        <p>虽然IPv6相对IPv4有着众多优势，但IPv6在我国的推广呈现出两个波浪。</p>

        <p>在2015年5月，《国务院办公厅关于加快高速宽带网络建设推进网络提速降费的指导意见》中提到，加大支持力度，促进向下一代互联网演进升级。</p>

        <p>2015年9月4日公布的《国务院印发三网融合推广方案的通知》中提到，网络承载和技术创新能力进一步提升，全面支持互联网协议第六版（IPv6）。</p>

        <p>但对着“意见”和“通知”的下发，我国并未快速进入IPv6时代，而这与当时产业的发展密切相关。</p>

        <p>相比发达国家，我国IPv6的发展则相对滞后，全球ICP的IPv6支持率为25．4％，中国仅为5．0％。</p>

        <p> 在应用方面，我国IPv6的产品极小，主流应用均未使用到IPv6，同时，国外由于技术限制，并未出口IPv6产品到我国，这导致我国对IPv6的需求并多。
        </p>
        <p>同时，由于NAT技术的成熟应用，我国所分配到的IPv4地址被NAT技术层层套用，一个IPv4地址被多人应用，而基于NAT技术，可以同时做到NAT技术套NAT，从而使一个IPv4地址承载了成千上百个设备。</p>

        <p>其次，则是利益相关。由于IPv4地址的稀缺性，IPv4地址价格极高，上游运营商能通过单个IPv4地址获取极大的利润。而一旦采用IPv6，上游运营商的利润将大幅度下跌。</p>

        <p>最后则是成本问题，IPv4由于应用了数十年，IPv4模块早已形成良好的产业链，价格相对IPv6而言极低。据相关产业人士说道：“随着中国网络设备数量的发展，‘IPv4＋NAT’的模式会继续存在一段时间。”</p>

        <p>然而，国内并非一直没有发展IPv6。在早些时候，我国曾积极推动IPv6的普及，首先用于教育网的建设，但在其他领域中的应用偏少。</p>

        <h3>2017，IPv6在中国的转机</h3>

        <p>2017年11月，中共中央办公厅、国务院办公厅印发了《推进互联网协议第六版（IPv6）规模部署行动计划》，并发出通知，要求各地区各部门结合实际认真贯彻落实。</p>

        <p>在2018年5月，工信部更是直接下达贯彻落实《推进互联网协议第六版（IPv6）规模部署行动计划》的通知，点名数十家企业必须加快IPv6建设。</p>

        <p> 基于《计划》，IPv6得到快速发展，虽然目前国内在IPv6排名方面已经在30名开外，但中国对于事情的专注度并非一般国家所能相比，据相关报导显示，截至2019 年5 月，三大基础电信企业的LTE 网络、城域网、国际出入口已基本完成IPv6 改造。云端的数据中心IDC、内容分发网络CDN、云服务平台（阿里云、腾讯云等）、DNS也都支持IPv6。终端方面，几乎所有主流家庭路由器、手机、操作系统也支持IPv6。
        </p>
        <p> 而在具体数据方面，据2019《中国IPv6发展状况》白皮书显示，截至2019 年6 月，我国IPv6 活跃用户数已达1．30 亿。我国基础电信企业已分配IPv6 地址的用户数达12．07 亿。
        </p>
        <p> 同时，我国IPv6 地址资源总量达到47282块／32，居全球第一位。IPv6 地址数量能够满足当前IPv6规模部署的要求，但不可忽视的是，随着物联网产业的发展，车辆网、工业互联网等产业的发展， 我国未来对IPv6地址的需求量会逐年增加。
        </p>
        <p> 但是随着物联网、车联网、工业互联网快速发展，我国未来对于依然较大。
        </p>
        <h3>IPv6，物联网时代亟待解决的问题</h3>
        <p> 随着IPv6的普及，物联网也将迎来新的“门牌”——基于IPv6协议的多地址性，能有效分配给每一个物联网设备，从而实现专网连接。但IPv6并非没有“缺陷”：
        </p>

        <ul>
          <li>
            1、IPv6虽然是下一代互联网通信协议，但由于应用时间问题，IPv6协议的发展还是缺少具体的商业化应用，在未来一段时间内，IPv6依然会与IPv4共存；

          </li>
          <li>
            2、由于IPv6和IPv4间的非对称性、过渡形式的多样性等问题，从IPv4过渡到IPv6的数据将面临着更为复杂的安全性问题；

          </li>

          <li>
            3、由于IPv6和IPv4传输数据报的基本机制没有发生改变，IPv4网络中除IP层以外的其他四层中出现的攻击在IPv6网络中依然会存在；
          </li>

          <li>
            4、由于缺乏大规模实践和深入的研究，IPv6实际安全防护能力如何还未明确。

          </li>
        </ul>

        <p> 在这一系列问题下，IPv6又将如何进行解决和修复，这将是物联网时代所必须解决的问题。
        </p>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
     p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
</style>