<template>
  <div class="info wrapper">
    <div class="content">
      <h1>工业和信息化部关于开展 2020 年 IPv6 端到端贯通能力提升专项行动的通知</h1>

      <div>
        <strong>各相关企业：</strong>
        <p>为贯彻落实《推进互联网协议第六版(IPv6)规模部署行动计划》（厅字〔2017〕47 号）
          任务要求，加快提升 IPv6 端到端贯通能力，持续提升 IPv6 活跃用户和网络流量规模，我部
          决定于 2020 年开展 IPv6 端到端贯通能力提升专项行动。有关事项通知如下：</p>
        <h3>一、重点工作任务</h3>
        <ul>
          <li> （一）优化提升 IPv6 网络接入能力。基础电信企业持续优化骨干网、城域网、接入网
            的 IPv6 网络质量，新增互联网骨干直联点同步完成 IPv6 升级改造；进一步丰富 IPv6 专线
            产品，在全国范围内为有需求的政企客户提供 IPv4/IPv6 双栈专线、IPv6 单栈专线、IPv6
            代播等多种业务。支持基础电信企业对 IPv6 单栈专线开通给予九五折或更大力度资费优惠。</li>
          <li>（二）加快提升内容分发网络（CDN）IPv6 应用加速能力。阿里云、腾讯云、网宿科
            技、蓝汛、金山云、百度云、华为云、京东云、帝联科技、UCloud、白山云、七牛云、鹏
            博士、中国移动加快内容分发网络 IPv6 深度改造，提升 IPv6 服务资源占比、扩大 IPv6 服
            务覆盖范围、优化 IPv6 应用加速性能。到 2020 年末，内容分发网络支持 IPv6 的节点数达
            到 IPv4 节点数的 85%以上；按地市级行政区划，IPv6 服务覆盖能力达到 IPv4 服务覆盖能
            力的 85%以上；IPv6 应用加速性能达到 IPv4 应用加速性能的 85%以上。</li>
          <li> （三）大幅提升云服务平台 IPv6 业务承载能力。阿里云、天翼云、腾讯云、沃云、华
            为云、移动云、百度云、金山云、京东云、UCloud、青云扩大支持 IPv6 的云产品数量，
            提升 IPv6 云产品的服务能力。到 2020 年末，完成包含云主机、容器引擎、负载均衡、域
            名解析、对象存储、MySQL 云数据库、MongoDB 云数据库、API 网关、Web 应用防火
            墙、DDOS 高防、文件存储（NAS）、对等连接服务（VPC）、HTTPDNS、数据库审计、
            微服务引擎、MapReduce 服务、设备接入服务（IoT Hub）、区块链服务、视频直播、人
            脸识别等在内的全部公有云产品的 IPv6 改造；国内支持 IPv6 服务的可用域（Region）数
            量达到全部 IPv4 可用域的 50%以上。</li>
          <li>（四）全面扩大数据中心（IDC）IPv6 覆盖范围。中国电信、中国移动、中国联通进一
            步加强对中小型数据中心和机房的 IPv6 改造。阿里云、腾讯云、百度云、京东云、华为云、
            世纪互联、鹏博士、秦淮科技、新网互联、方正信息、西部数码、万国数据、光环新网加快
            数据中心 IPv6 改造力度，到 2020 年第三季度末，完成年报中全部数据中心的 IPv6 改造，
            形成全国范围数据中心 IPv6 覆盖能力。</li>
          <li>（五）着力提升终端设备 IPv6 支持能力。普联（TP-Link）、友讯（D-Link）、华为、
            中兴、烽火、上海贝尔、新华三、腾达、华硕、网件、小米新生产的家庭网关、企业网关、
            无线路由器、智能家居终端应默认配置支持 IPv4/IPv6 双栈。天猫、京东、淘宝等电商平台
            应优先向用户推荐支持 IPv6 的终端设备。基础电信企业加速存量家庭网关的更新替换，到
            2020 年末，完成对所有可远程升级家庭网关 IPv6 升级。</li>
          <li>（六）稳步提升行业网站及互联网应用 IPv6 浓度。各省（区、市）通信管理局、部属
            各单位、部属各高校、基础电信企业继续深化门户网站 IPv6 改造，到 2020 年末，门户网
            站二级、三级链接的 IPv6 浓度达到 85%以上。
            基础电信企业集团及下属省级公司稳步提升自营移动互联网应用（APP）的 IPv6 浓度，
            到 2020 年末，排名前 10 位的自营移动互联网应用（APP）的 IPv6 浓度达到 60%以上；
            服务端统计的 IPv6 活跃用户占比达到 50%以上。
            应用宝、360 手机助手、豌豆荚、OPPO 软件商店、百度手机助手、华为应用市场、
            小米应用商店、VIVO 应用商店、MM 商场、沃商店对新上架的 APP 开展 IPv6 浓度检测，
            并设立 IPv6 应用专区，引导用户安装支持 IPv6 的应用。相关企业加强对开发工具包（SDK）
            及服务器端程序的 IPv6 升级改造工作。</li>
          <li> （七）着力强化 IPv6 网络安全保障能力。各相关企业要进一步完善针对 IPv6 的网络安
            全定级备案、风险评估、通报预警、灾难备份及恢复等工作。推动 IPv6 环境下网络安全产
            品和服务的应用，鼓励构建 IPv6 安全产品孵化平台和测试环境，推动在研 IPv6 安全产品孵
            化，强化 IPv6 安全产品应用性能验证。基础电信企业和重点 IDC、CDN 等企业要做好僵木
            蠕、移动互联网恶意程序监测处置系统、信息安全管理系统等安全技术手段 IPv6 配套改造
            工作，强化 IPv6 环境下漏洞、违法信息等的监测发现与处置。</li>

        </ul>

        <h3> 二、2020 年末主要目标</h3>

        <ul>
          <li> （一）IPv6 网络性能与 IPv4 趋同，平均丢包率、时延、连接建立成功率等指标与 IPv4
            相比劣化不超过 10%。</li>
          <li> （二）IPv6 活跃连接数达到 11.5 亿。其中，中国电信集团有限公司达到 2.9 亿，中国
            移动通信集团有限公司达到 6.4 亿，中国联合网络通信集团有限公司达到 2.2 亿。</li>
          <li> （三）移动网络 IPv6 流量占比达到 10%以上。</li>

        </ul>

        <h3>三、保障措施</h3>

        <ul>
          <li>
            （一）压实工作责任。各企业要对照年度任务目标，进一步细化分解，做到“落实举措、
            责任主体、完成时限”三明确。各基础电信企业集团公司要加强对各省级子（分）公司的工
            作部署和指导，及时掌握工作进展，开展检查督导，并在年度考核中将 IPv6 相关任务完成
            情况作为重要指标。
          </li>
          <li>
            （二）强化协同攻坚。工业和信息化部（信息通信发展司）组织成立 IPv6 规模部署专
            项协同推进工作组，制定可量化、可考核的技术规范和标准，以 IPv6 端到端贯通为核心目
            标，建立任务台账、安排专人对接、逐项协调解决，保障 IPv6 升级改造工作顺利推进。
          </li>
          <li> （三）完善技术监测。中国信息通信研究院要会同相关企业和产业联盟持续完善 IPv6
            发展监测平台，开展 IPv6 端到端网络性能监测，内容分发网络（CDN）、云平台、行业移
            动互联网应用（APP）、行业网站等的 IPv6 支持程度监测等工作，定期发布 IPv6 发展监测
            报告。各相关企业要配合做好监测节点部署工作。

          </li>
          <li> （四）开展抽查抽测。各地通信管理局要瞄准重点任务、紧扣时间节点，通过明查暗访
            或者利用 IPv6 发展监测平台在线抽测等形式，加强对属地相关企业推进 IPv6 相关工作进度
            与质量的日常监督。对于逾期未能完成工作任务的单位，视情通过约谈、通报等方式，督促
            尽快整改。

          </li>
        </ul>

        <footer>
          <p> 附件：IPv6 改造相关指标和测试方法说明</p>
          <dl>
            <dd>工业和信息化部</dd>
            <dd>2020 年 3 月 19 日</dd>
          </dl>

        </footer>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}

.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
</style>