<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/news' }">新闻列表</el-breadcrumb-item>
        <el-breadcrumb-item>新闻详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>上海市委网信办等四部门印发三年行动计划，推进IPv6规模部署 </h1>
        <p><time>发布时间： 2020-7-01</time>新闻出处： <a href="https://baijiahao.baidu.com/s?id=1671018580103261489&wfr=spider&for=pc">新民晚报</a> </p>
      </header>

      <div>
        <p>为加快推进上海市IPv6规模部署，促进基础网络及相关应用协同演进，推动互联网升级和健康创新发展，支撑新一代网络基础设施（“新网络”）建设行动，上海市委网信办、上海市发展改革委、上海市经济信息化委、上海市通信管理局近日联合印发《上海市推进互联网协议第六版（IPv6）规模部署三年行动计划（2020-2022年）》（以下简称《行动计划》），明确未来三年内上海市IPv6规模部署的总体考虑、主要任务和保障措施。通过三年的时间，统筹推进上海市IPv6发展，形成下一代互联网自主技术体系和产业生态，实现下一代互联网在经济社会各领域深度融合应用。
        </p>
        <p>《行动计划》提出开展基础网络IPv6改造、推进应用服务IPv6改造、强化IPv6网络安全保障、推动IPv6技术产业发展四个方面十一项主要任务。同时，为保障IPv6规模部署工作有序推进，《行动计划》还明确了加强组织领导、完善政策保障、优化发展环境、强化规范管理四大保障措施。
        </p>
        <p>具体详见《上海市推进互联网协议第六版（IPv6）规模部署三年行动计划（2020-2022年）》。
        </p>

        <p>上海市推进互联网协议第六版（IPv6）规模部署三年行动计划（2020-2022年）
        </p>

        <p>为进一步贯彻落实中共中央办公厅、国务院办公厅印发的《推进互联网协议第六版（IPv6）规模部署行动计划》和上海市人民政府印发的《上海市推进新型基础设施建设行动方案（2020-2022年）》，加快推进上海市IPv6规模部署，促进基础网络及相关应用协同演进，推动互联网升级和健康创新发展，支撑新一代网络基础设施（“新网络”）建设行动，结合上海实际，制订本行动计划。
        </p>
        <h2>一、总体考虑
        </h2>
        <h3>（一）指导思想
        </h3>
        <p>以习近平新时代中国特色社会主义思想为指导，紧紧围绕统筹推进“五位一体”总体布局和协调推进“四个全面”战略布局，牢固树立新发展理念，把握全球网络信息技术代际跃迁和网络基础设施演进升级的难得历史机遇，以协同推进IPv6规模部署为主线，以典型应用改造和特色应用创新为主攻方向，加快网络基础设施和应用基础设施升级步伐，积极构建自主技术体系和产业生态，实现互联网向IPv6演进升级，构建高速、移动、安全、泛在的新一代信息基础设施，促进互联网与经济社会深度融合，构筑未来发展新优势，为网络强国建设奠定坚实基础。
        </p>
        <h3>（二）基本原则
        </h3>
        <p><strong>统筹规划、重点突破。</strong> 加强顶层设计和统筹谋划，聚焦重点环节，着力弥补IPv6应用短板，强化互联网应用的需求拉动作用，实现技术、产业、网络、应用的协同推进。
        </p>
        <p><strong>创新发展、保障安全。</strong> 坚持发展与安全并举，大力促进下一代互联网与经济社会各领域融合创新，同步推进网络安全系统规划、建设、运行，保障互联网安全可靠、平滑演进。</p>
        <p><strong>注重实效、惠及民生。</strong> 贯彻以人民为中心的发展思想，紧紧围绕人民群众的期待和需求，不断提升网络服务水平，丰富信息服务内容。</p>

        <h3>（三）主要目标</h3>
        <p>2020-2022年，全面实施上海市推进互联网协议第六版（IPv6）规模部署三年行动计划。抓住一条主线，即围绕上海市IPv6推动互联网演进升级和创新健康发展的主线，开展四项行动，即“实现基础网络升级、形成应用创新生态、提升安全保障能力、完善技术产业发展”四项行动。通过三年的时间，统筹推进上海市IPv6发展，形成下一代互联网自主技术体系和产业生态，实现下一代互联网在经济社会各领域深度融合应用。
        </p>
        <ul>
          <li>——基础网络升级基本实现。基础网络设施全面完成IPv6改造,IPv6活跃用户占比互联网用户超过60%。互联网骨干网、骨干网网间互联、城域网和接入网，广电骨干网，新增网络设备、固定网络终端、移动终端全面支持IPv6。内容分发网络IPv6应用加速性能、云服务IPv6业务承载能力、数据中心IPv6覆盖范围和IPv4趋同。
          </li>
          <li>——应用创新生态逐渐形成。鼓励传统应用改造升级，推动重点行业及特色应用创新升级。持续推进市区级以上政府、公共事业单位、新闻及广播电视媒体及市属企业网站全面支持IPv6。推动实现用户多、使用广的典型互联网应用的IPv6升级，基于IPv6的特色应用创新实现深度强化，并推进网络、终端协同发展，促进IPv6创新生态更具活力。</li>
          <li>——安全保障能力持续提升。升级改造现有网络安全保障系统，推动现有网络安全保障系统向IPv6过渡过程中的升级改造，推进加快IPv6安全技术研发、应用和融合创新，开展IPv6相关网络安全管理、机制研究工作，增强对IPv6地址和网络环境的支持能力，提升IPv6网络安全防护水平。</li>
          <li>——技术产业发展不断完善。支持关键技术创新，推动核心设备与系统研发，推进探索IPv6技术标准研制，加强下一代互联网产业的顶层设计和统筹谋划，加大对网络基础性、前瞻性、创新性研究的支持力度。</li>
        </ul>

        <h2>二、主要任务</h2>
        <h3>（一）开展基础网络IPv6改造</h3>

        <p>1．全面升级网络基础设施</p>
        <p>推进电信运营企业深化IPv6改造力度，全面实现为移动网络用户分配IPv6地址，加快对固定宽带智能网关更新升级，提高固网IPv6渗透率，完善网络管理和支撑服务系统IPv6改造，提升IPv6网络接入能力。推动广电骨干网、有线电视接入网、家用终端的IPv6升级改造，实现广播电视内容、平台、网络、终端的全流程IPv6部署。进一步引入互联网域名根镜像服务器，提升IPv6地址访问互联网域名效率，试点建设新型互联网交换中心，完善IPv6骨干网间互联体系，推动上海市互联网骨干网直连点升级扩容，优化互联网、广电网骨干网络IPv6的互联互通。</p>

        <p>2．加速提升应用基础设施</p>
        <p>加强数据中心建设导则指引，确保新建数据中心全面支持IPv6，引导存量数据中心机房的IPv6改造。推动基础电信企业和应用基础设施企业实现数据中心内部网络和出口设备、内容分发网络、云服务平台、域名系统等IPv6改造，支持IPv6业务接入和承载。2021年底，内容分发网络支持IPv6的节点数、IPv6服务覆盖能力、IPv6应用加速性能均达到IPv4网络的90%以上，为互联网应用改造提供足够的内容加速资源。2022年，推动实现云服务企业充分发挥平台优势，在完成自身改造的同时，引导云上互联网应用和用户向IPv6迁移。
        </p>

        <h3>（二）推进应用服务IPv6改造</h3>
        <p>3．鼓励支持传统应用改造</p>
        <p>支持引导用户量大、服务面广的门户、社交、视频、电商、游戏、应用商店等网络服务改造并支持IPv6优先访问，提升IPv6用户数量及应用流量。加快推动IPv6产业布局，加快形成芯片、模块、设备、终端等完整支持IPv6的产业链体系，鼓励产业链上下游形成IPv6改造生态合作。加大研发支持力度，力争突破核心关键元器件瓶颈问题。积极培育IPv6产业生态，加强应用推广，探索形成一批IPv6的典型应用示范项目。</p>
        <p>4．逐步推进重点网站升级改造</p>
        <p>强化政府网站、新闻及广播电视媒体网站和应用的示范带动作用，逐级推进政府网站、新闻及广播电视媒体网站、国有企业外网网站IPv6升级改造。2020年底，上海市区级以上政府、公共事业单位、新闻及广播电视媒体及市属企业网站全面支持IPv6，完成电子政务外网升级和综治、金融、医疗、教育等领域公共管理、民生公益等服务平台改造。2021年底，推进上海市重点企业的外网网站全面完成IPv6改造，对互联网应用支持IPv6提出明确的要求，并设定相应的时间，在下一轮网络设备和业务系统更替时同步实施。</p>
        <p>5．推动特色应用升级创新</p>
        <p>支持地址需求量大的特色IPv6创新应用，结合上海加快推进5G网络建设工作，在“互联网+”新型智慧城市、5G、工业互联网、云计算、物联网、智能制造、人工智能、区块链等工作中加大IPv6推广应用力度。引导5G创新应用全面支持IPv6，推动为网内终端分配专属IP地址，提升数据转发效率，实现端到端、个性化的便捷服务。引导支持重点行业工业企业开展企业内网IPv6网络化改造，创新工业互联网应用实践，完善企业IPv6应用、管理、安全等相关标准。
        </p>
        <h3>（三）强化IPv6网络安全保障</h3>
        <p>6．加强IPv6安全防护体系</p>
        <p>将IPv6相关网络基础设施及应用基础设施安全防护纳入电信和互联网网络安全防护体系，做好现有网络安全保障系统在IPv4向IPv6过渡过程中的升级改造。鼓励产学研用各方加强协同，加快IPv6安全技术研发、应用和融合创新。落实国家网络安全等级保护制度和通信网络安全防护管理制度，开展针对IPv6环境下的通信网络安全定级备案、个人信息保护、风险评估、通报预警、灾难备份及恢复等工作，加强安全防护手段的IPv6配套改造工作，强化IPv6环境下漏洞、违法信息等监测发现与处置能力。到2021年，统筹上海市IPv6地址申请、分配、备案等管理工作，严格落实IPv6网络地址编码规划方案，协同推进IPv6部署与网络实名制。</p>
        <p>7．加强IPv6安全技术研发</p>
        <p>推进IPv6网络环境下的网络安全机制和关键技术研发，提高网络安全态势感知、快速处置、侦查打击能力。深入开展IPv6相关网络安全技术、管理及机制研究工作，升级改造现有网络安全保障系统，增强对IPv6地址和网络环境的支持能力，提升IPv6网络安全防护水平。</p>
        <p>8．构筑新兴领域安全保障</p>
        <p>围绕IPv6发展需求，培育龙头骨干企业，加大人才培养和引进力度，加强IPv6环境下工业互联网、物联网、车联网、云计算、大数据、人工智能、区块链等领域的网络安全技术、管理及机制研究，构筑新兴领域安全保障能力。</p>
        <h3>（四）推动IPv6技术产业发展</h3>
        <p>9．支持IPv6关键技术研发</p>
        <p>支持网络过渡、网络安全、新型路由等关键技术创新，支持网络处理器、嵌入式操作系统、重要应用软件、终端与网络设备、安全设备与系统、网络测量仪器仪表等核心设备系统IPv6技术研发，积极参与IPv6技术标准研究制定。</p>
        <p>10．强化网络前沿技术创新</p>
        <p>处理好IPv6发展与网络技术创新、互联网中长期演进的关系，加强下一代互联网的顶层设计和统筹谋划，支持探索IPv6下一代互联网先进网络基础设施创新与服务，进一步加大对网络基础性、前瞻性、创新性研究的支持力度。</p>
        <p>11．加强IPv6关键指标监测</p>
        <p>借助IPv6综合性第三方监测平台，通过主动被动挖掘和用户参与等方式，实现对上海IPv6地址分配、活跃度情况、流量带宽等关键对象监测，可视化展示历史数据态势和发展趋势，定期发布监测报告。</p>
        <h2> 三、保障措施</h2>
        <h3>（一）加强组织领导</h3>
        <p>深化网信、发展改革、经济信息化、通信管理、教育、科技、公安、新闻出版广电、财政等部门协同推进机制，强化统筹协调，明确责任分工，加强部门、行业、区域间合作,扎实推进落实IPv6规模部署工作的重点任务。健全专家咨询制度，充分发挥调查研究和决策咨询作用，提供高质量咨询意见。鼓励行业组织和其他专业机构广泛参与，完善政企间沟通协调机制。
        </p>
        <h3>（二）完善政策保障</h3>
        <p>统筹安排相关专项资金，支持IPv6产品研发和技术储备，鼓励IPv6在5G、工业互联网等领域的特色应用创新。针对创新引领明显、带动面广、社会效益大的信息关键技术等项目给予重点扶持。充分发挥企业在IPv6发展中的主体地位作用，激发市场需求和企业发展的内生动力。</p>
        <h3>（三）优化发展环境</h3>
        <p>统筹资金，加大支持力度，鼓励社会资金投入，充分发挥企业主体作用，推动IPv6技术创新、基础设施改造、应用部署、安全保障等领域发展。加大IPv6规模部署宣传力度，引导用户向IPv6迁移。加快下一代互联网相关学科建设，加大下一代互联网技术、管理、人才培养力度。加大对公众普遍关注问题的科普宣传力度，提高公众认知度和感知度。</p>
        <h3>（四）强化规范管理
        </h3>
        <p>完善互联网网站、移动互联网应用等管理要求，引导和推动互联网信息服务、内容分发网络、云服务、移动虚拟运营、宽带接入等企业在系统和业务上支持IPv6。完善政府采购要求，明确相关设备、系统和服务支持IPv6。在基础电信企业业绩考核中，支持和鼓励企业积极开展IPv6相关工作。完善并严格落实设备进网中有关IPv6的检测要求，定期开展企业、行业、区域应用情况评测。
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
    p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
</style>