<template>
  <div class="info wrapper">
    <div class="bread">
      <el-breadcrumb separator-class="el-icon-arrow-right">
        <el-breadcrumb-item :to="{ path: '/' }">首页</el-breadcrumb-item>
        <el-breadcrumb-item :to="{ path: '/news' }">新闻列表</el-breadcrumb-item>
        <el-breadcrumb-item>新闻详情</el-breadcrumb-item>
      </el-breadcrumb>
    </div>

    <div class="content">
      <header>
        <h1>我国IPv6规模部署进展如何？ </h1>
        <p><time>发布时间： 2020-6-28</time>新闻出处： <a href="http://www.caict.ac.cn/kxyj/caictgd/202006/t20200628_285037.htm">中国信通院CATCT</a> </p>
      </header>

      <div>
        <h3> 一、IPv4地址完全耗尽，我国政府出台《行动计划》</h3>
        <p>2019年11月25日，负责英国、欧洲、中东和部分中亚地区互联网资源分配的欧洲网络协调中心（RIPE NCC）宣布，其最后的IPv4地址空间储备池在UTC + 1 15:35 完全耗尽，所有43亿个IPv4地址已分配完毕。这意味着没有更多的IPv4地址可以分配给ISP和其他大型网络基础设施提供商。
          　　IP 地址的全球性管理机构为互联网号码分配局（IANA），其下有五个局域网际网络注册管理机构（RIR）。由IANA管理的IPv4地址，于2011年1月31日完全用尽。其他五个区域的可核发地址，除了为迁移IPv6而保留的最后一块/8地址外，也随之陆续用尽。
          　　我国一直高度重视IPv6和下一代互联网发展，2017年11月，中共中央办公厅、国务院办公厅印发了《推进互联网协议第六版（IPv6）规模部署行动计划》（简称《行动计划》），明确提出了未来5—10年我国基于IPv6的下一代互联网发展的总体目标、路线图、时间表和重点任务，是加快推进我国IPv6规模部署、促进互联网演进升级和健康创新发展的行动指南。IPv6为我国网络设施升级、技术产业创新、经济社会发展提供了重大契机，加快推进IPv6规模部署是我囯新一代信息基础设施升级的必然要求，也是下一代互联网发展的必由之路。
          　</p>
        <h3>二、我国IPv6规模部署工作呈现加速发展态势</h3>
        <p>行动计划实施以来，政府部门、基础电信企业、互联网企业、通信设备与服务提供商、相关中央企业、事业单位、科研机构等密切配合，积极响应，全社会广泛参与，纷纷制定具体的落地实施方案和工作计划，加快IPv6升级改造，我国IPv6规模部署工作呈现加速发展态势。
          　　国家IPv6发展监测平台数据显示，截至2019年11月，我国IPv6活跃用户数达2.739亿。根据《中国互联网络发展状况统计报告》统计，目前我国网民规模达8.54亿。按此比例，我国IPv6活跃用户占比已经超过30%。
          　　政府和央企充分发挥了示范带头作用。截至2019年11月底，省部级以上政府网站和央企网站中已有161家网站的首页可通过IPv6访问，占比高达86%，真正发挥了政府先导示范作用，建立了明确的市场导向和政府应用的先行意识。
          　　2019年，重点互联网应用IPv6改造取得积极进展。龙头互联网企业均建立了企业内部推进IPv6升级改造的组织架构，确立了由公司高层领导牵头、各部门协同参与的工作机制，制定了企业明确的IPv6规模部署工作计划。大部分互联网企业已按计划落实完成了年度改造任务，并在全国部分区域灰度上线。截至2019年11月，国内用户量排名前100位的商业网站和应用中可通过IPv6访问的共有78家，占比为78%。
          　　基础资源方面，截至2019年11月，我国已申请IPv6地址资源总量达到47851块（/32），位居全球第一位。当前，我国IPv6地址拥有量能够满足当前IPv6商业规模部署的要求，但是随着物联网、车联网、工业互联网快速发展，我国未来对于IPv6地址的需求量依然较大。
          　　中国电信、中国移动和中国联通等基础电信企业加快基础设施的改造步伐，三大基础电信企业的超大型、大型IDC、中小型IDC已经全部完成了IPv6改造。全国30个省的LTE网络、城域网也全部开始提供IPv6服务。全国13个骨干直联点已经全部完成IPv6改造，支持互联网网间IPv6流量交换，中国电信、中国移动、中国联通、中国广电、教育网和科研网累计开通IPv6网间带宽6.39Tbps；13个骨干直连点的开启，对提升IPv6网络质量起到了重要的作用。
          　</p>
        <h3>三、规模部署成绩喜人，目前仍存在一些主要问题
        </h3>

        <p>经过近一年积极行动，我国IPv6规模部署已经取得了重大进展与阶段性成果，但要清醒的认识到，我国IPv6规模部署工作仍处于起步阶段，在活跃用户比例和流量比例等方面，与国际领先国家相比还有不小的差距，当前存在着一些亟待解决的突出问题。
          　　尽管网络和终端支持IPv6能力大幅提升，超过12亿用户获得IPv6地址，但由于支持IPv6访问的应用较少，IPv6流量尚未形成一定规模；另外，虽然目前有部分网站及应用的首页已经支持IPv6/IPv4双栈访问，用户数的统计中已经产生大量IPv6活跃用户数，但是支持IPv6程度大多只局限于IPv6首页可达，更深层次的链接还未支持IPv6访问，真正产生流量的流媒体、图片等仍然使用IPv4建立连接，改造的力度与深度对IPv6的支持度还远远不够。总体而言，重点互联网网站及应用的带动作用还未真正发挥，IPv6网络流量还没有质的飞跃。
          　　内容分发网络、云服务平台等应用基础设施是互联网内容和应用的重要载体，对于优化互联网流量、提高网络承载能力具有不可替代的作用。除少数大型企业具有自建CDN，多数互联网企业使用商业CDN加速应用访问，各地区IPv6应用上线时间将与CDN改造进度息息相关。尤其是视频类等大流量应用，对用户访问带宽和时延高度敏感，更加依赖CDN加速。大部分商业网站使用的是云服务，各项IPv6技术改造工作与云服务平台IPv6改造密切相关。因此，这些企业在推进落实IPv6部署过程中，对第三方云平台接入服务升级改造的依赖性较强，很难掌握工作进度。虽然大型CDN企业IPv6支持情况有一定的改善，但节点数量、覆盖率都仍显不足，改造进度严重滞后。
          　　此外，家庭无线路由器支持IPv6的情况不佳，也是目前影响IPv6规模部署的重要原因。中国信通院于2019年4月和10月开展2次对家庭路由器设备的集中验证工作，结果显示，目前我国市场主流家庭无线路由器对IPv6的支持度非常低，管理功能较差，严重影响IPv6端到端贯通。
          　　</p>
        <h3>四、IPv6发展机遇与挑战并存，未来应持续加大改造</h3>
        <p>按照《行动计划》要求，未来几年，作为下一代互联网发展的基础，IPv6规模部署将持续推进。我国IPv6发展有着良好的应用基础和广阔的市场空间，应加大推进力度，补齐短板，整合资源优势，发挥政府先行作用，带动整个行业健康有序发展，抓住全球网络信息技术加速创新变革、信息基础设施快速演进升级的历史机遇，加强统筹谋划，加快推进IPv6规模部署，构建高速率、广普及、全覆盖、智能化的下一代互联网，从而达到“到2025年末，我国IPv6网络规模、用户规模、流量规模位居世界第一位，网络、应用、终端全面支持IPv6，全面完成向下一代互联网的平滑演进升级，形成全球领先的下一代互联网技术产业体系。”</p>

      </div>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {
    };
  },
  computed: {},
  created() { },
  mounted() { },
  methods: {},
  watch: {},
};
</script>

<style lang="less" scoped>
.wrapper {
  width: 1200px;
  margin: 0 auto;
}
.bread {
  padding: 20px 0;
}
.content {
  padding: 80px 50px;
  box-shadow: 0 0 10px #eee;
  margin-bottom: 50px;
  color: #666;
  font-size: 16px;
  line-height: 1.4;

  header {
    margin-bottom: 40px;
    p {
      text-align: center;
    }
    time {
      padding-right: 30px;
    }
  }

  h1 {
    font-size: 24px;
    margin-bottom: 30px;
    color: #333;
    text-align: center;
  }
  h3 {
    margin: 20px 0;
    color: #333;
  }
  p {
    margin-bottom: 15px;
    text-indent: 2em;
  }
  ul {
    padding: 0;
  }
  li {
    margin-bottom: 12px;
    list-style: none;
    text-indent: 2em;
  }

  footer {
    p {
      margin: 20px;
    }
    dd {
      text-align: right;
      margin-bottom: 10px;
    }
  }
}
</style>